
//8. Напишите метод, которому в качестве аргументов передается строка и число, метод
// должен отпечатать в консоль указанную строку, указанное количество раз;

public class Lesson_48 {
    public static void main(String[] args){
        int a=4;
        String b = "какая-то строка";
        metod(a,b);
}

    private static void metod(int a, String b) {
        int Q;
        for(Q=0; Q<a; Q++){
        System.out.println(b);}
    }
    }
